{ "steps": [{
    "text": "Trip to Burning Man You are a dirty hippie trying to get laid. The only thing you have going for you is a lot of drugs. You decide to go to Burning Man to trade drugs for sex. Which way will you go? South on I-5 through the beautiful Willamette Valley or take US 26 across the Cascades and drive through eastern Oregon.",
    "choices": [{
      "choiceText": "South",
      "choiceId": 1
    },{
      "choiceText": "East",
      "choiceId": 2
    }]
  }, {
    "text": "You barely make it out of Portland before you die in a fiery pile-up on I-5 South."
  }, {
    "text": " The austere beauty of eastern Oregon almost makes you happy. Almost. You pass several small towns and you wonder whether you could make a genuine human connection with any of the inhabitants. Maybe then you wouldn't have to trade drugs for sex at Burning Man. But then a voice in the back of your head -- maybe your mother's -- makes you feel small, ugly, and dirty. Just after you slip across the border you smell burning rubber. Before you can think a tire explodes. You manage to wrestle the car to a stop. The smell of gasoline fills the air. As you climb out you see a pack of rabid, drooling Californians approaching. They look hungry.",
    "choices": [{
      "choiceText": "Burn the car",
      "choiceId": 3
    },{
      "choiceText": "Run, coward!",
      "choiceId": 4
    }]
  }, {
    "text": " What a brilliant idea! As the Californians approach you toss your zippo at the car. The explosion is huge and intense. As it engulfs your backpack full of drugs you feel sad. You won't be trading those for sex. As it engulfs your body you think, \"Oh. Right.\""
  }, {
    "text": "You throw your last delicious avocado at the Californians and stumble into the desert. You spend the night in panicked flight before stumbling exhausted into the brush. You awake in fright.",
    "choices": [{
      "choiceText": "Continue south on foot",
      "choiceId": 5
    }, {
      "choiceText": "Head east. Get as far from those Californians as you can.",
      "choiceId": 6
    }]
  }, {
    "text": "You reach the town of Surprise Station, CA. (Real fucking place. Look it up, fucker.) You are HUNGRY and as you might remember you have no avocados. You NEED to eat, NOW.",
    "choices": [{
      "choiceText": "Go to the diner.",
      "choiceId": 7
    }, {
      "choiceText": "Go to the store.",
      "choiceId": 8
    }]
  }, {
    "text": "You head east into northern Nevada. Winds from the southwest blow tumbleweeds across your path. You stumble into a rundown ranch and meet Andy. \"This is Andy's place,\" Andy says. \"You're not Andy. What are you doin' here.\" He levels his shotgun at your face.",
    "choices": [{
      "choiceText": "Talk things over.",
      "choiceId": 9
    }, {
      "choiceText": "You've had enough of this. FIGHT!",
      "choiceId": 10
    }]
  }, {
    "text": "You slide, exhausted, into a booth at the Diner. Something feels wrong. You have a brief moment of recognition as the waitress approaches your table. She was in the pack of rabid Californians last night when your car broke down. \"Surprise, motherfucker!\" she yells before you take a shotgun blast to the face."
  }, {
    "text" : "You arrive at the local Stab N Grab, stocked to the gills with all kinds of tasty treats. You even see more avocados! As you wander your way through the building, grabbing quinoa and kale and coconut, you begin to think \"Hey, I think I really might make it to Burning Man!\" \n    As you're paying, a group of super heady brahs walk in the door. They look pretty cool, so you approach them. \"Hey dudes, any chance you're heading to Burning Man?\" They all look up, a bit of a dead look in their eyes, and the tallest of them says, \"Yeah dude, we're headed there after we buy some hummus. You need a ride?\" And just like that, you might have finally caught your break.",
    "choices": [{
      "choiceText": "Go with the hippies.",
      "choiceId": 11
    }, {
      "choiceText": "Tell them, \"It's not about the journey, man, it's about the destination...thanks anyway.\"",
      "choiceId": 12
    }]
  }, {
    "text" : "\"Hey man, I don't want any trou-\" you start to utter. Then, with no warning, Andy shoots you in your face."
  }, {
    "text": "Your impaired reflexes kick in. You leap towards Andy, grabbing the barrel of the gun and swinging it away from you. \n BOOM! The gun goes off! \n With a single punch to the neck with your dirty noodle arms, you lay Andy out. You lean over him, kicking the shotgun to the side. \n\n Andy is dead. A strange calm descends upon you.",
    "choices": [{
      "choiceText": "Raid Andy's house for any food for the rest of your journey.",
      "choiceId": 13
    }, {
      "choiceText": "Leave Andy behind, heading south towards salvation",
      "choiceId": 14
    }]
  }, {
    "text": "You get in the hippies van with them, even carrying their hummus for them. Surprise! Manson Family! You die and go to hell!"
  }, {
    "text": "The hippies are offended and outraged that you refused their hospitality. Surprise! Manson Family! You die and go to hell!"
  }, {
    "text": "You are so hungry. You know you won't get far without food so you decide to check Andy's place for food. There's not much in his shack but then to your relief you find a root cellar fully stocked with canned vegetables, grains, roots, and strange meat jerky. Do you want to use the stove and cook something here or grab what you can carry and continue hiking south?",
    "choices": [{
      "choiceText": "I deserve a hot meal.",
      "choiceId": 15
    }, {
      "choiceText": "Got to keep moving.",
      "choiceId": 16
    }]
  }, {
    "text": "You're really hungry. You stumble into the desert with visions of avocados dancing before your eyes. You are so, so hungry. Why didn't you look for food before you left Andy's place? You decide to eat some mushrooms from your pack. You hallucinate vividly before succumbing to dysentery. You die in the desert and vultures and grubs leave your bleached bones in the sun."
  }, {
    "text" : "It doesn't seem right to you to leave the only shelter you've seen for miles. Last night was, after all, really cold in the desert. So you cook yourself a nice warm meal. The strange meat jerky tastes a lot better reconstituted with water, and some peppers and potatoes make a satisfying meal. As relief washes over you, you fall asleep. \n \n When you awaken you are covered in rattlesnakes. They must have been drawn by your body heat. You:",
    "choices": [{
      "choiceText": "Freak out",
      "choiceId": 17
    }, {
      "choiceText": "Calmly get up",
      "choiceId": 17
    }]
  }, {
    "text" : "After grabbing what you can easily carry (strange meat jerky mostly) you decide to move on quickly. Do you follow the road or cut across the open desert?",
    "choices": [{
      "choiceText": "The road",
      "choiceId": 18
    }, {
      "choiceText": "The desert",
      "choiceId": 19
    }]
  }, {
    "text" : "You get bitten by snakes many, many times and slump to the floor of Andy's shack. The snakes snuggle close to you for warmth. Your body doesn't grow cold until morning. Then they slither away to bask in the sun. \n Days later you're found by Nevada Highway Patrol. It's a small consolation that your parents never learn what happened to you or what you did to Andy. You've been dead to them for years anyway."
  }, {
    "text" : "You have had enough of the open desert. You decide to follow the road and hopefully thumb a ride to Burning Man. After a few hours you finally hear a car. Had you looked you might have hidden, but instead you thoughtlessly wave down the NEVADA HIGHWAY PATROL. Who, as look would have it are looking for you. Well, actually they're looking for Andy's killer which is the same thing. Will you surrender or try to evade capture?",
    "choices": [{
      "choiceText": "Surrender. Andy tried to kill you, after all.",
      "choiceId": 20
    }, {
      "choiceText": "Run!",
      "choiceId": 21
    }]
  }, {
    "text" : "You don't trust the road. Roads mean people, and people have brought you nothing but suffering so far. So after checking a map you decide to cut across the desert. You figure if you get close to Burning Man the sky will glow at night to guide you the rest of the way. Pretty good thinking. Too bad you didn't plan for the GILA MONSTER SWARM!!!",
    "choices": [{
      "choiceText": "Run! There's no reasoning with a Gila monster swarm.",
      "choiceId": 22
    }, {
      "choiceText": "You've had enough of this. Fight!",
      "choiceId": 23
    }]
  }, {
    "text": "You decide to surrender to the cops. You may not make it to burning man, but there's no way running can end well for you. Besides, you killed Andy in self defense. Unfortunately, you are carrying POUNDS of controlled substances and strange meat jerky which testing reveals to be HUMAN FLESH. You die in the electric chair and go to hell."
  }, {
    "text": "You know there's no explaining the pounds of drugs in your backpack, so you decide to make a run for it. \"Stop or I'll shoot,\" the officer shouts. Too bad you didn't believe him. The first bullet barely grazes your skin and doesn't hurt too bad. The next thirteen bullets are terrible."
  }, {
    "text": "Although disturbing to look at, a gila monster swarm is really just a bunch of gila monsters. And that means slow in any language. You easily evade them and continue on your way to Burning Man. Eventually you see an orange throb in the sky and smell patchouli, b.o. and port-a-potties. You have arrived. As you approach you realize you don't have your ticket. You:",
    "choices": [{
      "choiceText": "Go to will call",
      "choiceId": 24
    }, {
      "choiceText": "Sneak in",
      "choiceId": 25
    }]
  }, {
    "text" : "You are so amazingly stupid it's a wonder you've made it this far. To quote Dr. Ward in the Arizona Graphic, September 23, 1899: \"I think a man who is fool enough to get bitten by a Gila monster ought to die. The creature is so sluggish and slow of movement that the victim of its bite is compelled to help largely in order to get bitten.\" You should have just walked away from the swarm."
  }, {
    "text" : "You go to will call and explain that you haven't got your ticket. They look up your order and hand you a ticket. Burning Man has excellent customer service.",
    "choices": [{
      "choiceText": "Find some ladies who want to party",
      "choiceId": 26
    }, {
      "choiceText": "Take your drugs and go looking for action",
      "choiceId": 27
    }]
  }, {
    "text" : "You never make it past the perimeter. You are immediately swarmed by nerds in night vision goggles. They kill you and steal your drugs and you die and go to hell."
  }, {
    "text" : "You begin your search with enthusiasm. This is Burning Man, after all! You made it! You're here and you're gonna get laid! You talk and talk and search and search. Before you know it, you've been at Burning Man for almost 3 days and still no ladies. You suddenly keel over of dehydration and hunger. No ladies stop to help, since you've creeped them all out. As death edges closer, you are buried by sand."
  }, {
    "text" : "You decide to just have some fun and see if you can get laid in the meantime. You swallow all the drugs that will fit in your dirty mouth and start walking towards the brightest light you can see. It's not long before everything starts kicking in, and the world turns into a wonderful rainbow. After meeting God and having a nice chat, God points you towards a beautiful woman. She's tall, lean, just a real hard body. He says, \"She's yours to do with as you wish.\" You make sweet, sweet, sweet whoopie with her for what feels like eternity. It's so good it feels like your body is on fire. In fact, your body IS on fire! You've been humping the giant Man all night, and now it's time for the Burning thereof. You're crisped before you can react, with your muscle control inhibited by the party going on in your brain. No one ever even knows you were there."
        }]
}
